# -*- coding: utf-8 -*-
"""
Created on Tue Jun 16 18:40:16 2020

@author: hagit

קלוט מהמשתמש מספר חיובי ושלם n והדפס (בצורה ערוכה, ראה דוגמא) את לוח
הכפל nXn באופן שיודפסו רק הכפולות המתחלקות ב-3 ללא שארית (כפולה היא
תוצאה של פעולת כפל). עבור כפולה שאינה מתחלקת ב-3 יש להדפיס *.
אם המשתמש הקיש n לא חיובי יש להודיע הודעה ולסיים.

לדוגמא: עבור 5=n יודפס המבנה הבא:
* * 3 * *
* * 6 * *
3 6 9 12 15
* * 12 * *
* * 15 * *
הצג דוגמת הרצה עבור 6 = n 
"""


n=int(input('Please enter a positive number: '))
for x in range(1, n+1):
    for y in range(1, n+1):
        z = x * y
        if (z%3 == 0):
            print(z, end="\t")
        else:
            print("*", end="\t")
    print()
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    